[{
  "film": "'Predator'",
  "overview": "'Dutch and his group of commandos are hired by the CIA to rescue downed airmen from guerillas in a Central American jungle. The mission goes well but as they return they find that something is hunting them. Nearly invisible, it blends in with the forest, taking trophies from the bodies of its victims as it goes along. Occasionally seeing through its eyes, the audience sees it is an intelligent alien hunter, hunting them for sport, killing them off one at a time.'",
  "imageUrl": "'https://image.tmdb.org/t/p/w600_and_h900_bestv2/gUpto7r2XwoM5eW7MUvd8hl1etB.jpg'",
  "imdbScore": "'7.4'",
  "trailerLink": "'https://www.youtube.com/watch?v=K9AT3tQGbIk'"
},
{
  "film": "'Blade Runner'",
  "overview": "'In the smog-choked dystopian Los Angeles of 2019, blade runner Rick Deckard is called out of retirement to terminate a quartet of replicants who have escaped to Earth seeking their creator for a way to extend their short life spans.'",
  "imageUrl": "'https://image.tmdb.org/t/p/w600_and_h900_bestv2/vfzE3pjE5G7G7kcZWrA3fnbZo7V.jpg'",
  "imdbScore": "'7.9'",
  "trailerLink": "'https://www.youtube.com/watch?v='"
},
{
  "film": "'Mortal Engines'",
  "overview": "'Many thousands of years in the future, Earth’s cities roam the globe on huge wheels, devouring each other in a struggle for ever diminishing resources. On one of these massive traction cities, the old London, Tom Natsworthy has an unexpected encounter with a mysterious young woman from the wastelands who will change the course of his life forever.'",
  "imageUrl": "'https://image.tmdb.org/t/p/w600_and_h900_bestv2/uXJVpPXxZO4L8Rz3IG1Y8XvZJcg.jpg'",
  "imdbScore": "'5.9'",
  "trailerLink": "'https://www.youtube.com/watch?v=IRsFc2gguEg'"
},
{
  "film": "'Black Panther'",
  "overview": "'King T'Challa returns home from America to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne by factions within his own country as well as without. Using powers reserved to Wakandan kings, T'Challa assumes the Black Panther mantel to join with girlfriend Nakia, the queen-mother, his princess-kid sister, members of the Dora Milaje (the Wakandan 'special forces') and an American secret agent, to prevent Wakanda from being dragged into a world war.'",
  "imageUrl": "'https://image.tmdb.org/t/p/w600_and_h900_bestv2/uxzzxijgPIY7slzFvMotPv8wjKA.jpg'",
  "imdbScore": "'7.4'",
  "trailerLink": "'https://www.youtube.com/watch?v=xjDjIWPwcPU'"
},
{
  "film": "'GoodFellas'",
  "overview": "'The true story of Henry Hill, a half-Irish, half-Sicilian Brooklyn kid who is adopted by neighbourhood gangsters at an early age and climbs the ranks of a Mafia family under the guidance of Jimmy Conway.'",
  "imageUrl": "'https://image.tmdb.org/t/p/w600_and_h900_bestv2/hAPeXBdGDGmXRPj4OZZ0poH65Iu.jpg'",
  "imdbScore": "'8.4'",
  "trailerLink": "'https://www.youtube.com/watch?v=2ilzidi_J8Q'"
},
{
  "film": "'The Assassination of Jesse James by the Coward Robert Ford'",
  "overview": "'Outlaw Jesse James is rumored to be the 'fastest gun in the West'. An eager recruit into James' notorious gang, Robert Ford eventually grows jealous of the famed outlaw and, when Robert and his brother sense an opportunity to kill James, their murderous action elevates their target to near mythical status.'",
  "imageUrl": "'https://image.tmdb.org/t/p/w600_and_h900_bestv2/lSFYLoaL4eW7Q5VQ7SZQP4EHRCt.jpg'",
  "imdbScore": "'7'",
  "trailerLink": "'https://www.youtube.com/watch?v=nk0JaEwhf00'"
},
{
  "film": "'Point Break'",
  "overview": "'A young undercover FBI agent infiltrates a gang of thieves who share a common interest in extreme sports. A remake of the 1991 film, \"Point Break\".'",
  "imageUrl": "'https://image.tmdb.org/t/p/w600_and_h900_bestv2/4zfbf70df2ySChbsIEjhAC9oXJ1.jpg'",
  "imdbScore": "'5.6'",
  "trailerLink": "'https://www.youtube.com/watch?v=ncvFAm4kYCo'"
},
{
  "film": "'Venom'",
  "overview": "'Investigative journalist Eddie Brock attempts a comeback following a scandal, but accidentally becomes the host of Venom, a violent, super powerful alien symbiote. Soon, he must rely on his newfound powers to protect the world from a shadowy organization looking for a symbiote of their own.'",
  "imageUrl": "'https://image.tmdb.org/t/p/w600_and_h900_bestv2/2uNW4WbgBXL25BAbXGLnLqX71Sw.jpg'",
  "imdbScore": "'6.6'",
  "trailerLink": "'https://www.youtube.com/watch?v=u9Mv98Gr5pY'"
}
]